docs/assign09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 14:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 9</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 9</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org58aa211">1. Goals: <code>Object</code> class contracts.</a></li>
<li><a href="#orga44b241">2. Grading Criteria</a></li>
<li><a href="#org58f3e3a">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org58aa211" class="outline-2">
<h2 id="org58aa211"><span class="section-number-2">1</span> Goals: <code>Object</code> class contracts.</h2>
<div class="outline-text-2" id="text-1">
<p>
As it happens, Liskov's implementation of <code>clone()</code> for the <code>IntSet</code> class (see figure 5.10, page 97) is wrong.
</p>

<ol class="org-ol">
<li>Use the <a href="./files/IntSet.java">version</a> of <code>IntSet</code> from the in-class exercise. Implement a subtype of <code>IntSet</code> to demonstrate the problem. Your solution should include appropiate executable code in the form of JUnit tests.</li>
<li>Provide a correct implementation of <code>clone()</code> for <code>IntSet</code>. Again, give appropriate JUnit tests.</li>
<li>Correctly override <code>hashCode()</code> and <code>equals()</code>. As discussed in the class exercise, the standard recipe is not appropriate in this (unusual) case.</li>
</ol>
</div>
</div>

<div id="outline-container-orga44b241" class="outline-2">
<h2 id="orga44b241"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<p>
In addititon to code and tests, your deliverable is a story. Explain what is going on at each stage of the exercise. The GTA will primarily grade your story.
</p>
</div>
</div>


<div id="outline-container-org58f3e3a" class="outline-2">
<h2 id="org58f3e3a"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
